bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/pwm_reg.h
/**
  ******************************************************************************
  * @file    pwm_reg.h
  * @version V1.0
  * @date    2022-05-24
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2022 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __PWM_REG_H__
#define __PWM_REG_H__

#include "bl702l.h"

/* 0x0 : pwm_int_config */
#define PWM_INT_CONFIG_OFFSET (0x0)
#define PWM_SC0_INT_STS       PWM_SC0_INT_STS
#define PWM_SC0_INT_STS_POS   (0U)
#define PWM_SC0_INT_STS_LEN   (1U)
#define PWM_SC0_INT_STS_MSK   (((1U << PWM_SC0_INT_STS_LEN) - 1) << PWM_SC0_INT_STS_POS)
#define PWM_SC0_INT_STS_UMSK  (~(((1U << PWM_SC0_INT_STS_LEN) - 1) << PWM_SC0_INT_STS_POS))
#define PWM_MC0_INT_STS       PWM_MC0_INT_STS
#define PWM_MC0_INT_STS_POS   (1U)
#define PWM_MC0_INT_STS_LEN   (1U)
#define PWM_MC0_INT_STS_MSK   (((1U << PWM_MC0_INT_STS_LEN) - 1) << PWM_MC0_INT_STS_POS)
#define PWM_MC0_INT_STS_UMSK  (~(((1U << PWM_MC0_INT_STS_LEN) - 1) << PWM_MC0_INT_STS_POS))
#define PWM_SC0_INT_CLR       PWM_SC0_INT_CLR
#define PWM_SC0_INT_CLR_POS   (8U)
#define PWM_SC0_INT_CLR_LEN   (1U)
#define PWM_SC0_INT_CLR_MSK   (((1U << PWM_SC0_INT_CLR_LEN) - 1) << PWM_SC0_INT_CLR_POS)
#define PWM_SC0_INT_CLR_UMSK  (~(((1U << PWM_SC0_INT_CLR_LEN) - 1) << PWM_SC0_INT_CLR_POS))
#define PWM_MC0_INT_CLR       PWM_MC0_INT_CLR
#define PWM_MC0_INT_CLR_POS   (9U)
#define PWM_MC0_INT_CLR_LEN   (1U)
#define PWM_MC0_INT_CLR_MSK   (((1U << PWM_MC0_INT_CLR_LEN) - 1) << PWM_MC0_INT_CLR_POS)
#define PWM_MC0_INT_CLR_UMSK  (~(((1U << PWM_MC0_INT_CLR_LEN) - 1) << PWM_MC0_INT_CLR_POS))

/* 0x40 : pwm0_sc0_clkdiv */
#define PWM0_SC0_CLKDIV_OFFSET (0x40)
#define PWM_SC0_CLK_DIV        PWM_SC0_CLK_DIV
#define PWM_SC0_CLK_DIV_POS    (0U)
#define PWM_SC0_CLK_DIV_LEN    (16U)
#define PWM_SC0_CLK_DIV_MSK    (((1U << PWM_SC0_CLK_DIV_LEN) - 1) << PWM_SC0_CLK_DIV_POS)
#define PWM_SC0_CLK_DIV_UMSK   (~(((1U << PWM_SC0_CLK_DIV_LEN) - 1) << PWM_SC0_CLK_DIV_POS))

/* 0x44 : pwm0_sc0_thre1 */
#define PWM0_SC0_THRE1_OFFSET (0x44)
#define PWM_SC0_THRE1         PWM_SC0_THRE1
#define PWM_SC0_THRE1_POS     (0U)
#define PWM_SC0_THRE1_LEN     (16U)
#define PWM_SC0_THRE1_MSK     (((1U << PWM_SC0_THRE1_LEN) - 1) << PWM_SC0_THRE1_POS)
#define PWM_SC0_THRE1_UMSK    (~(((1U << PWM_SC0_THRE1_LEN) - 1) << PWM_SC0_THRE1_POS))

/* 0x48 : pwm0_sc0_thre2 */
#define PWM0_SC0_THRE2_OFFSET (0x48)
#define PWM_SC0_THRE2         PWM_SC0_THRE2
#define PWM_SC0_THRE2_POS     (0U)
#define PWM_SC0_THRE2_LEN     (16U)
#define PWM_SC0_THRE2_MSK     (((1U << PWM_SC0_THRE2_LEN) - 1) << PWM_SC0_THRE2_POS)
#define PWM_SC0_THRE2_UMSK    (~(((1U << PWM_SC0_THRE2_LEN) - 1) << PWM_SC0_THRE2_POS))

/* 0x4C : pwm0_sc0_period */
#define PWM0_SC0_PERIOD_OFFSET (0x4C)
#define PWM_SC0_PERIOD         PWM_SC0_PERIOD
#define PWM_SC0_PERIOD_POS     (0U)
#define PWM_SC0_PERIOD_LEN     (16U)
#define PWM_SC0_PERIOD_MSK     (((1U << PWM_SC0_PERIOD_LEN) - 1) << PWM_SC0_PERIOD_POS)
#define PWM_SC0_PERIOD_UMSK    (~(((1U << PWM_SC0_PERIOD_LEN) - 1) << PWM_SC0_PERIOD_POS))

/* 0x50 : pwm0_sc0_config */
#define PWM0_SC0_CONFIG_OFFSET    (0x50)
#define PWM_SC0_REG_CLK_SEL       PWM_SC0_REG_CLK_SEL
#define PWM_SC0_REG_CLK_SEL_POS   (0U)
#define PWM_SC0_REG_CLK_SEL_LEN   (2U)
#define PWM_SC0_REG_CLK_SEL_MSK   (((1U << PWM_SC0_REG_CLK_SEL_LEN) - 1) << PWM_SC0_REG_CLK_SEL_POS)
#define PWM_SC0_REG_CLK_SEL_UMSK  (~(((1U << PWM_SC0_REG_CLK_SEL_LEN) - 1) << PWM_SC0_REG_CLK_SEL_POS))
#define PWM_SC0_OUT_INV           PWM_SC0_OUT_INV
#define PWM_SC0_OUT_INV_POS       (2U)
#define PWM_SC0_OUT_INV_LEN       (1U)
#define PWM_SC0_OUT_INV_MSK       (((1U << PWM_SC0_OUT_INV_LEN) - 1) << PWM_SC0_OUT_INV_POS)
#define PWM_SC0_OUT_INV_UMSK      (~(((1U << PWM_SC0_OUT_INV_LEN) - 1) << PWM_SC0_OUT_INV_POS))
#define PWM_SC0_STOP_MODE         PWM_SC0_STOP_MODE
#define PWM_SC0_STOP_MODE_POS     (3U)
#define PWM_SC0_STOP_MODE_LEN     (1U)
#define PWM_SC0_STOP_MODE_MSK     (((1U << PWM_SC0_STOP_MODE_LEN) - 1) << PWM_SC0_STOP_MODE_POS)
#define PWM_SC0_STOP_MODE_UMSK    (~(((1U << PWM_SC0_STOP_MODE_LEN) - 1) << PWM_SC0_STOP_MODE_POS))
#define PWM_SC0_SW_FORCE_VAL      PWM_SC0_SW_FORCE_VAL
#define PWM_SC0_SW_FORCE_VAL_POS  (4U)
#define PWM_SC0_SW_FORCE_VAL_LEN  (1U)
#define PWM_SC0_SW_FORCE_VAL_MSK  (((1U << PWM_SC0_SW_FORCE_VAL_LEN) - 1) << PWM_SC0_SW_FORCE_VAL_POS)
#define PWM_SC0_SW_FORCE_VAL_UMSK (~(((1U << PWM_SC0_SW_FORCE_VAL_LEN) - 1) << PWM_SC0_SW_FORCE_VAL_POS))
#define PWM_SC0_SW_MODE           PWM_SC0_SW_MODE
#define PWM_SC0_SW_MODE_POS       (5U)
#define PWM_SC0_SW_MODE_LEN       (1U)
#define PWM_SC0_SW_MODE_MSK       (((1U << PWM_SC0_SW_MODE_LEN) - 1) << PWM_SC0_SW_MODE_POS)
#define PWM_SC0_SW_MODE_UMSK      (~(((1U << PWM_SC0_SW_MODE_LEN) - 1) << PWM_SC0_SW_MODE_POS))
#define PWM_SC0_STOP_EN           PWM_SC0_STOP_EN
#define PWM_SC0_STOP_EN_POS       (6U)
#define PWM_SC0_STOP_EN_LEN       (1U)
#define PWM_SC0_STOP_EN_MSK       (((1U << PWM_SC0_STOP_EN_LEN) - 1) << PWM_SC0_STOP_EN_POS)
#define PWM_SC0_STOP_EN_UMSK      (~(((1U << PWM_SC0_STOP_EN_LEN) - 1) << PWM_SC0_STOP_EN_POS))
#define PWM_SC0_STS_TOP           PWM_SC0_STS_TOP
#define PWM_SC0_STS_TOP_POS       (7U)
#define PWM_SC0_STS_TOP_LEN       (1U)
#define PWM_SC0_STS_TOP_MSK       (((1U << PWM_SC0_STS_TOP_LEN) - 1) << PWM_SC0_STS_TOP_POS)
#define PWM_SC0_STS_TOP_UMSK      (~(((1U << PWM_SC0_STS_TOP_LEN) - 1) << PWM_SC0_STS_TOP_POS))
#define PWM_SC0_STOP_ON_INT       PWM_SC0_STOP_ON_INT
#define PWM_SC0_STOP_ON_INT_POS   (8U)
#define PWM_SC0_STOP_ON_INT_LEN   (1U)
#define PWM_SC0_STOP_ON_INT_MSK   (((1U << PWM_SC0_STOP_ON_INT_LEN) - 1) << PWM_SC0_STOP_ON_INT_POS)
#define PWM_SC0_STOP_ON_INT_UMSK  (~(((1U << PWM_SC0_STOP_ON_INT_LEN) - 1) << PWM_SC0_STOP_ON_INT_POS))

/* 0x54 : pwm0_sc0_interrupt */
#define PWM0_SC0_INTERRUPT_OFFSET   (0x54)
#define PWM_SC0_INT_PERIOD_CNT      PWM_SC0_INT_PERIOD_CNT
#define PWM_SC0_INT_PERIOD_CNT_POS  (0U)
#define PWM_SC0_INT_PERIOD_CNT_LEN  (16U)
#define PWM_SC0_INT_PERIOD_CNT_MSK  (((1U << PWM_SC0_INT_PERIOD_CNT_LEN) - 1) << PWM_SC0_INT_PERIOD_CNT_POS)
#define PWM_SC0_INT_PERIOD_CNT_UMSK (~(((1U << PWM_SC0_INT_PERIOD_CNT_LEN) - 1) << PWM_SC0_INT_PERIOD_CNT_POS))
#define PWM_SC0_INT_ENABLE          PWM_SC0_INT_ENABLE
#define PWM_SC0_INT_ENABLE_POS      (16U)
#define PWM_SC0_INT_ENABLE_LEN      (1U)
#define PWM_SC0_INT_ENABLE_MSK      (((1U << PWM_SC0_INT_ENABLE_LEN) - 1) << PWM_SC0_INT_ENABLE_POS)
#define PWM_SC0_INT_ENABLE_UMSK     (~(((1U << PWM_SC0_INT_ENABLE_LEN) - 1) << PWM_SC0_INT_ENABLE_POS))

/* 0x80 : pwm_mc0_config0 */
#define PWM_MC0_CONFIG0_OFFSET (0x80)
#define PWM_CLK_DIV            PWM_CLK_DIV
#define PWM_CLK_DIV_POS        (0U)
#define PWM_CLK_DIV_LEN        (16U)
#define PWM_CLK_DIV_MSK        (((1U << PWM_CLK_DIV_LEN) - 1) << PWM_CLK_DIV_POS)
#define PWM_CLK_DIV_UMSK       (~(((1U << PWM_CLK_DIV_LEN) - 1) << PWM_CLK_DIV_POS))
#define PWM_STOP_ON_REPT       PWM_STOP_ON_REPT
#define PWM_STOP_ON_REPT_POS   (19U)
#define PWM_STOP_ON_REPT_LEN   (1U)
#define PWM_STOP_ON_REPT_MSK   (((1U << PWM_STOP_ON_REPT_LEN) - 1) << PWM_STOP_ON_REPT_POS)
#define PWM_STOP_ON_REPT_UMSK  (~(((1U << PWM_STOP_ON_REPT_LEN) - 1) << PWM_STOP_ON_REPT_POS))
#define PWM_ADC_TRG_SRC        PWM_ADC_TRG_SRC
#define PWM_ADC_TRG_SRC_POS    (20U)
#define PWM_ADC_TRG_SRC_LEN    (4U)
#define PWM_ADC_TRG_SRC_MSK    (((1U << PWM_ADC_TRG_SRC_LEN) - 1) << PWM_ADC_TRG_SRC_POS)
#define PWM_ADC_TRG_SRC_UMSK   (~(((1U << PWM_ADC_TRG_SRC_LEN) - 1) << PWM_ADC_TRG_SRC_POS))
#define PWM_SW_BREAK_EN        PWM_SW_BREAK_EN
#define PWM_SW_BREAK_EN_POS    (24U)
#define PWM_SW_BREAK_EN_LEN    (1U)
#define PWM_SW_BREAK_EN_MSK    (((1U << PWM_SW_BREAK_EN_LEN) - 1) << PWM_SW_BREAK_EN_POS)
#define PWM_SW_BREAK_EN_UMSK   (~(((1U << PWM_SW_BREAK_EN_LEN) - 1) << PWM_SW_BREAK_EN_POS))
#define PWM_EXT_BREAK_EN       PWM_EXT_BREAK_EN
#define PWM_EXT_BREAK_EN_POS   (25U)
#define PWM_EXT_BREAK_EN_LEN   (1U)
#define PWM_EXT_BREAK_EN_MSK   (((1U << PWM_EXT_BREAK_EN_LEN) - 1) << PWM_EXT_BREAK_EN_POS)
#define PWM_EXT_BREAK_EN_UMSK  (~(((1U << PWM_EXT_BREAK_EN_LEN) - 1) << PWM_EXT_BREAK_EN_POS))
#define PWM_EXT_BREAK_PL       PWM_EXT_BREAK_PL
#define PWM_EXT_BREAK_PL_POS   (26U)
#define PWM_EXT_BREAK_PL_LEN   (1U)
#define PWM_EXT_BREAK_PL_MSK   (((1U << PWM_EXT_BREAK_PL_LEN) - 1) << PWM_EXT_BREAK_PL_POS)
#define PWM_EXT_BREAK_PL_UMSK  (~(((1U << PWM_EXT_BREAK_PL_LEN) - 1) << PWM_EXT_BREAK_PL_POS))
#define PWM_STOP_EN            PWM_STOP_EN
#define PWM_STOP_EN_POS        (27U)
#define PWM_STOP_EN_LEN        (1U)
#define PWM_STOP_EN_MSK        (((1U << PWM_STOP_EN_LEN) - 1) << PWM_STOP_EN_POS)
#define PWM_STOP_EN_UMSK       (~(((1U << PWM_STOP_EN_LEN) - 1) << PWM_STOP_EN_POS))
#define PWM_STOP_MODE          PWM_STOP_MODE
#define PWM_STOP_MODE_POS      (28U)
#define PWM_STOP_MODE_LEN      (1U)
#define PWM_STOP_MODE_MSK      (((1U << PWM_STOP_MODE_LEN) - 1) << PWM_STOP_MODE_POS)
#define PWM_STOP_MODE_UMSK     (~(((1U << PWM_STOP_MODE_LEN) - 1) << PWM_STOP_MODE_POS))
#define PWM_STS_STOP           PWM_STS_STOP
#define PWM_STS_STOP_POS       (29U)
#define PWM_STS_STOP_LEN       (1U)
#define PWM_STS_STOP_MSK       (((1U << PWM_STS_STOP_LEN) - 1) << PWM_STS_STOP_POS)
#define PWM_STS_STOP_UMSK      (~(((1U << PWM_STS_STOP_LEN) - 1) << PWM_STS_STOP_POS))
#define PWM_REG_CLK_SEL        PWM_REG_CLK_SEL
#define PWM_REG_CLK_SEL_POS    (30U)
#define PWM_REG_CLK_SEL_LEN    (2U)
#define PWM_REG_CLK_SEL_MSK    (((1U << PWM_REG_CLK_SEL_LEN) - 1) << PWM_REG_CLK_SEL_POS)
#define PWM_REG_CLK_SEL_UMSK   (~(((1U << PWM_REG_CLK_SEL_LEN) - 1) << PWM_REG_CLK_SEL_POS))

