bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/pwm_reg.h
/* 0x84 : pwm_mc0_config1 */
#define PWM_MC0_CONFIG1_OFFSET (0x84)
#define PWM_CH0_PEN            PWM_CH0_PEN
#define PWM_CH0_PEN_POS        (0U)
#define PWM_CH0_PEN_LEN        (1U)
#define PWM_CH0_PEN_MSK        (((1U << PWM_CH0_PEN_LEN) - 1) << PWM_CH0_PEN_POS)
#define PWM_CH0_PEN_UMSK       (~(((1U << PWM_CH0_PEN_LEN) - 1) << PWM_CH0_PEN_POS))
#define PWM_CH0_PSI            PWM_CH0_PSI
#define PWM_CH0_PSI_POS        (1U)
#define PWM_CH0_PSI_LEN        (1U)
#define PWM_CH0_PSI_MSK        (((1U << PWM_CH0_PSI_LEN) - 1) << PWM_CH0_PSI_POS)
#define PWM_CH0_PSI_UMSK       (~(((1U << PWM_CH0_PSI_LEN) - 1) << PWM_CH0_PSI_POS))
#define PWM_CH0_NEN            PWM_CH0_NEN
#define PWM_CH0_NEN_POS        (2U)
#define PWM_CH0_NEN_LEN        (1U)
#define PWM_CH0_NEN_MSK        (((1U << PWM_CH0_NEN_LEN) - 1) << PWM_CH0_NEN_POS)
#define PWM_CH0_NEN_UMSK       (~(((1U << PWM_CH0_NEN_LEN) - 1) << PWM_CH0_NEN_POS))
#define PWM_CH0_NSI            PWM_CH0_NSI
#define PWM_CH0_NSI_POS        (3U)
#define PWM_CH0_NSI_LEN        (1U)
#define PWM_CH0_NSI_MSK        (((1U << PWM_CH0_NSI_LEN) - 1) << PWM_CH0_NSI_POS)
#define PWM_CH0_NSI_UMSK       (~(((1U << PWM_CH0_NSI_LEN) - 1) << PWM_CH0_NSI_POS))
#define PWM_CH1_PEN            PWM_CH1_PEN
#define PWM_CH1_PEN_POS        (4U)
#define PWM_CH1_PEN_LEN        (1U)
#define PWM_CH1_PEN_MSK        (((1U << PWM_CH1_PEN_LEN) - 1) << PWM_CH1_PEN_POS)
#define PWM_CH1_PEN_UMSK       (~(((1U << PWM_CH1_PEN_LEN) - 1) << PWM_CH1_PEN_POS))
#define PWM_CH1_PSI            PWM_CH1_PSI
#define PWM_CH1_PSI_POS        (5U)
#define PWM_CH1_PSI_LEN        (1U)
#define PWM_CH1_PSI_MSK        (((1U << PWM_CH1_PSI_LEN) - 1) << PWM_CH1_PSI_POS)
#define PWM_CH1_PSI_UMSK       (~(((1U << PWM_CH1_PSI_LEN) - 1) << PWM_CH1_PSI_POS))
#define PWM_CH1_NEN            PWM_CH1_NEN
#define PWM_CH1_NEN_POS        (6U)
#define PWM_CH1_NEN_LEN        (1U)
#define PWM_CH1_NEN_MSK        (((1U << PWM_CH1_NEN_LEN) - 1) << PWM_CH1_NEN_POS)
#define PWM_CH1_NEN_UMSK       (~(((1U << PWM_CH1_NEN_LEN) - 1) << PWM_CH1_NEN_POS))
#define PWM_CH1_NSI            PWM_CH1_NSI
#define PWM_CH1_NSI_POS        (7U)
#define PWM_CH1_NSI_LEN        (1U)
#define PWM_CH1_NSI_MSK        (((1U << PWM_CH1_NSI_LEN) - 1) << PWM_CH1_NSI_POS)
#define PWM_CH1_NSI_UMSK       (~(((1U << PWM_CH1_NSI_LEN) - 1) << PWM_CH1_NSI_POS))
#define PWM_CH2_PEN            PWM_CH2_PEN
#define PWM_CH2_PEN_POS        (8U)
#define PWM_CH2_PEN_LEN        (1U)
#define PWM_CH2_PEN_MSK        (((1U << PWM_CH2_PEN_LEN) - 1) << PWM_CH2_PEN_POS)
#define PWM_CH2_PEN_UMSK       (~(((1U << PWM_CH2_PEN_LEN) - 1) << PWM_CH2_PEN_POS))
#define PWM_CH2_PSI            PWM_CH2_PSI
#define PWM_CH2_PSI_POS        (9U)
#define PWM_CH2_PSI_LEN        (1U)
#define PWM_CH2_PSI_MSK        (((1U << PWM_CH2_PSI_LEN) - 1) << PWM_CH2_PSI_POS)
#define PWM_CH2_PSI_UMSK       (~(((1U << PWM_CH2_PSI_LEN) - 1) << PWM_CH2_PSI_POS))
#define PWM_CH2_NEN            PWM_CH2_NEN
#define PWM_CH2_NEN_POS        (10U)
#define PWM_CH2_NEN_LEN        (1U)
#define PWM_CH2_NEN_MSK        (((1U << PWM_CH2_NEN_LEN) - 1) << PWM_CH2_NEN_POS)
#define PWM_CH2_NEN_UMSK       (~(((1U << PWM_CH2_NEN_LEN) - 1) << PWM_CH2_NEN_POS))
#define PWM_CH2_NSI            PWM_CH2_NSI
#define PWM_CH2_NSI_POS        (11U)
#define PWM_CH2_NSI_LEN        (1U)
#define PWM_CH2_NSI_MSK        (((1U << PWM_CH2_NSI_LEN) - 1) << PWM_CH2_NSI_POS)
#define PWM_CH2_NSI_UMSK       (~(((1U << PWM_CH2_NSI_LEN) - 1) << PWM_CH2_NSI_POS))
#define PWM_CH3_PEN            PWM_CH3_PEN
#define PWM_CH3_PEN_POS        (12U)
#define PWM_CH3_PEN_LEN        (1U)
#define PWM_CH3_PEN_MSK        (((1U << PWM_CH3_PEN_LEN) - 1) << PWM_CH3_PEN_POS)
#define PWM_CH3_PEN_UMSK       (~(((1U << PWM_CH3_PEN_LEN) - 1) << PWM_CH3_PEN_POS))
#define PWM_CH3_PSI            PWM_CH3_PSI
#define PWM_CH3_PSI_POS        (13U)
#define PWM_CH3_PSI_LEN        (1U)
#define PWM_CH3_PSI_MSK        (((1U << PWM_CH3_PSI_LEN) - 1) << PWM_CH3_PSI_POS)
#define PWM_CH3_PSI_UMSK       (~(((1U << PWM_CH3_PSI_LEN) - 1) << PWM_CH3_PSI_POS))
#define PWM_CH3_NEN            PWM_CH3_NEN
#define PWM_CH3_NEN_POS        (14U)
#define PWM_CH3_NEN_LEN        (1U)
#define PWM_CH3_NEN_MSK        (((1U << PWM_CH3_NEN_LEN) - 1) << PWM_CH3_NEN_POS)
#define PWM_CH3_NEN_UMSK       (~(((1U << PWM_CH3_NEN_LEN) - 1) << PWM_CH3_NEN_POS))
#define PWM_CH3_NSI            PWM_CH3_NSI
#define PWM_CH3_NSI_POS        (15U)
#define PWM_CH3_NSI_LEN        (1U)
#define PWM_CH3_NSI_MSK        (((1U << PWM_CH3_NSI_LEN) - 1) << PWM_CH3_NSI_POS)
#define PWM_CH3_NSI_UMSK       (~(((1U << PWM_CH3_NSI_LEN) - 1) << PWM_CH3_NSI_POS))
#define PWM_CH0_PPL            PWM_CH0_PPL
#define PWM_CH0_PPL_POS        (16U)
#define PWM_CH0_PPL_LEN        (1U)
#define PWM_CH0_PPL_MSK        (((1U << PWM_CH0_PPL_LEN) - 1) << PWM_CH0_PPL_POS)
#define PWM_CH0_PPL_UMSK       (~(((1U << PWM_CH0_PPL_LEN) - 1) << PWM_CH0_PPL_POS))
#define PWM_CH0_NPL            PWM_CH0_NPL
#define PWM_CH0_NPL_POS        (17U)
#define PWM_CH0_NPL_LEN        (1U)
#define PWM_CH0_NPL_MSK        (((1U << PWM_CH0_NPL_LEN) - 1) << PWM_CH0_NPL_POS)
#define PWM_CH0_NPL_UMSK       (~(((1U << PWM_CH0_NPL_LEN) - 1) << PWM_CH0_NPL_POS))
#define PWM_CH1_PPL            PWM_CH1_PPL
#define PWM_CH1_PPL_POS        (18U)
#define PWM_CH1_PPL_LEN        (1U)
#define PWM_CH1_PPL_MSK        (((1U << PWM_CH1_PPL_LEN) - 1) << PWM_CH1_PPL_POS)
#define PWM_CH1_PPL_UMSK       (~(((1U << PWM_CH1_PPL_LEN) - 1) << PWM_CH1_PPL_POS))
#define PWM_CH1_NPL            PWM_CH1_NPL
#define PWM_CH1_NPL_POS        (19U)
#define PWM_CH1_NPL_LEN        (1U)
#define PWM_CH1_NPL_MSK        (((1U << PWM_CH1_NPL_LEN) - 1) << PWM_CH1_NPL_POS)
#define PWM_CH1_NPL_UMSK       (~(((1U << PWM_CH1_NPL_LEN) - 1) << PWM_CH1_NPL_POS))
#define PWM_CH2_PPL            PWM_CH2_PPL
#define PWM_CH2_PPL_POS        (20U)
#define PWM_CH2_PPL_LEN        (1U)
#define PWM_CH2_PPL_MSK        (((1U << PWM_CH2_PPL_LEN) - 1) << PWM_CH2_PPL_POS)
#define PWM_CH2_PPL_UMSK       (~(((1U << PWM_CH2_PPL_LEN) - 1) << PWM_CH2_PPL_POS))
#define PWM_CH2_NPL            PWM_CH2_NPL
#define PWM_CH2_NPL_POS        (21U)
#define PWM_CH2_NPL_LEN        (1U)
#define PWM_CH2_NPL_MSK        (((1U << PWM_CH2_NPL_LEN) - 1) << PWM_CH2_NPL_POS)
#define PWM_CH2_NPL_UMSK       (~(((1U << PWM_CH2_NPL_LEN) - 1) << PWM_CH2_NPL_POS))
#define PWM_CH3_PPL            PWM_CH3_PPL
#define PWM_CH3_PPL_POS        (22U)
#define PWM_CH3_PPL_LEN        (1U)
#define PWM_CH3_PPL_MSK        (((1U << PWM_CH3_PPL_LEN) - 1) << PWM_CH3_PPL_POS)
#define PWM_CH3_PPL_UMSK       (~(((1U << PWM_CH3_PPL_LEN) - 1) << PWM_CH3_PPL_POS))
#define PWM_CH3_NPL            PWM_CH3_NPL
#define PWM_CH3_NPL_POS        (23U)
#define PWM_CH3_NPL_LEN        (1U)
#define PWM_CH3_NPL_MSK        (((1U << PWM_CH3_NPL_LEN) - 1) << PWM_CH3_NPL_POS)
#define PWM_CH3_NPL_UMSK       (~(((1U << PWM_CH3_NPL_LEN) - 1) << PWM_CH3_NPL_POS))
#define PWM_CH0_PBS            PWM_CH0_PBS
#define PWM_CH0_PBS_POS        (24U)
#define PWM_CH0_PBS_LEN        (1U)
#define PWM_CH0_PBS_MSK        (((1U << PWM_CH0_PBS_LEN) - 1) << PWM_CH0_PBS_POS)
#define PWM_CH0_PBS_UMSK       (~(((1U << PWM_CH0_PBS_LEN) - 1) << PWM_CH0_PBS_POS))
#define PWM_CH0_NBS            PWM_CH0_NBS
#define PWM_CH0_NBS_POS        (25U)
#define PWM_CH0_NBS_LEN        (1U)
#define PWM_CH0_NBS_MSK        (((1U << PWM_CH0_NBS_LEN) - 1) << PWM_CH0_NBS_POS)
#define PWM_CH0_NBS_UMSK       (~(((1U << PWM_CH0_NBS_LEN) - 1) << PWM_CH0_NBS_POS))
#define PWM_CH1_PBS            PWM_CH1_PBS
#define PWM_CH1_PBS_POS        (26U)
#define PWM_CH1_PBS_LEN        (1U)
#define PWM_CH1_PBS_MSK        (((1U << PWM_CH1_PBS_LEN) - 1) << PWM_CH1_PBS_POS)
#define PWM_CH1_PBS_UMSK       (~(((1U << PWM_CH1_PBS_LEN) - 1) << PWM_CH1_PBS_POS))
#define PWM_CH1_NBS            PWM_CH1_NBS
#define PWM_CH1_NBS_POS        (27U)
#define PWM_CH1_NBS_LEN        (1U)
#define PWM_CH1_NBS_MSK        (((1U << PWM_CH1_NBS_LEN) - 1) << PWM_CH1_NBS_POS)
#define PWM_CH1_NBS_UMSK       (~(((1U << PWM_CH1_NBS_LEN) - 1) << PWM_CH1_NBS_POS))
#define PWM_CH2_PBS            PWM_CH2_PBS
#define PWM_CH2_PBS_POS        (28U)
#define PWM_CH2_PBS_LEN        (1U)
#define PWM_CH2_PBS_MSK        (((1U << PWM_CH2_PBS_LEN) - 1) << PWM_CH2_PBS_POS)
#define PWM_CH2_PBS_UMSK       (~(((1U << PWM_CH2_PBS_LEN) - 1) << PWM_CH2_PBS_POS))
#define PWM_CH2_NBS            PWM_CH2_NBS
#define PWM_CH2_NBS_POS        (29U)
#define PWM_CH2_NBS_LEN        (1U)
#define PWM_CH2_NBS_MSK        (((1U << PWM_CH2_NBS_LEN) - 1) << PWM_CH2_NBS_POS)
#define PWM_CH2_NBS_UMSK       (~(((1U << PWM_CH2_NBS_LEN) - 1) << PWM_CH2_NBS_POS))
#define PWM_CH3_PBS            PWM_CH3_PBS
#define PWM_CH3_PBS_POS        (30U)
#define PWM_CH3_PBS_LEN        (1U)
#define PWM_CH3_PBS_MSK        (((1U << PWM_CH3_PBS_LEN) - 1) << PWM_CH3_PBS_POS)
#define PWM_CH3_PBS_UMSK       (~(((1U << PWM_CH3_PBS_LEN) - 1) << PWM_CH3_PBS_POS))
#define PWM_CH3_NBS            PWM_CH3_NBS
#define PWM_CH3_NBS_POS        (31U)
#define PWM_CH3_NBS_LEN        (1U)
#define PWM_CH3_NBS_MSK        (((1U << PWM_CH3_NBS_LEN) - 1) << PWM_CH3_NBS_POS)
#define PWM_CH3_NBS_UMSK       (~(((1U << PWM_CH3_NBS_LEN) - 1) << PWM_CH3_NBS_POS))

/* 0x88 : pwm_mc0_period */
#define PWM_MC0_PERIOD_OFFSET   (0x88)
#define PWM_PERIOD              PWM_PERIOD
#define PWM_PERIOD_POS          (0U)
#define PWM_PERIOD_LEN          (16U)
#define PWM_PERIOD_MSK          (((1U << PWM_PERIOD_LEN) - 1) << PWM_PERIOD_POS)
#define PWM_PERIOD_UMSK         (~(((1U << PWM_PERIOD_LEN) - 1) << PWM_PERIOD_POS))
#define PWM_INT_PERIOD_CNT      PWM_INT_PERIOD_CNT
#define PWM_INT_PERIOD_CNT_POS  (16U)
#define PWM_INT_PERIOD_CNT_LEN  (16U)
#define PWM_INT_PERIOD_CNT_MSK  (((1U << PWM_INT_PERIOD_CNT_LEN) - 1) << PWM_INT_PERIOD_CNT_POS)
#define PWM_INT_PERIOD_CNT_UMSK (~(((1U << PWM_INT_PERIOD_CNT_LEN) - 1) << PWM_INT_PERIOD_CNT_POS))

/* 0x8C : pwm_mc0_dead_time */
#define PWM_MC0_DEAD_TIME_OFFSET (0x8C)
#define PWM_CH0_DTG              PWM_CH0_DTG
#define PWM_CH0_DTG_POS          (0U)
#define PWM_CH0_DTG_LEN          (8U)
#define PWM_CH0_DTG_MSK          (((1U << PWM_CH0_DTG_LEN) - 1) << PWM_CH0_DTG_POS)
#define PWM_CH0_DTG_UMSK         (~(((1U << PWM_CH0_DTG_LEN) - 1) << PWM_CH0_DTG_POS))
#define PWM_CH1_DTG              PWM_CH1_DTG
#define PWM_CH1_DTG_POS          (8U)
#define PWM_CH1_DTG_LEN          (8U)
#define PWM_CH1_DTG_MSK          (((1U << PWM_CH1_DTG_LEN) - 1) << PWM_CH1_DTG_POS)
#define PWM_CH1_DTG_UMSK         (~(((1U << PWM_CH1_DTG_LEN) - 1) << PWM_CH1_DTG_POS))
#define PWM_CH2_DTG              PWM_CH2_DTG
#define PWM_CH2_DTG_POS          (16U)
#define PWM_CH2_DTG_LEN          (8U)
#define PWM_CH2_DTG_MSK          (((1U << PWM_CH2_DTG_LEN) - 1) << PWM_CH2_DTG_POS)
#define PWM_CH2_DTG_UMSK         (~(((1U << PWM_CH2_DTG_LEN) - 1) << PWM_CH2_DTG_POS))
#define PWM_CH3_DTG              PWM_CH3_DTG
#define PWM_CH3_DTG_POS          (24U)
#define PWM_CH3_DTG_LEN          (8U)
#define PWM_CH3_DTG_MSK          (((1U << PWM_CH3_DTG_LEN) - 1) << PWM_CH3_DTG_POS)
#define PWM_CH3_DTG_UMSK         (~(((1U << PWM_CH3_DTG_LEN) - 1) << PWM_CH3_DTG_POS))

