bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/pwm_reg.h
/* 0xAC : pwm_mc0_int_en */
#define PWM_MC0_INT_EN_OFFSET   (0xAC)
#define PWM_CR_PWM_CH0L_EN      PWM_CR_PWM_CH0L_EN
#define PWM_CR_PWM_CH0L_EN_POS  (0U)
#define PWM_CR_PWM_CH0L_EN_LEN  (1U)
#define PWM_CR_PWM_CH0L_EN_MSK  (((1U << PWM_CR_PWM_CH0L_EN_LEN) - 1) << PWM_CR_PWM_CH0L_EN_POS)
#define PWM_CR_PWM_CH0L_EN_UMSK (~(((1U << PWM_CR_PWM_CH0L_EN_LEN) - 1) << PWM_CR_PWM_CH0L_EN_POS))
#define PWM_CR_PWM_CH0H_EN      PWM_CR_PWM_CH0H_EN
#define PWM_CR_PWM_CH0H_EN_POS  (1U)
#define PWM_CR_PWM_CH0H_EN_LEN  (1U)
#define PWM_CR_PWM_CH0H_EN_MSK  (((1U << PWM_CR_PWM_CH0H_EN_LEN) - 1) << PWM_CR_PWM_CH0H_EN_POS)
#define PWM_CR_PWM_CH0H_EN_UMSK (~(((1U << PWM_CR_PWM_CH0H_EN_LEN) - 1) << PWM_CR_PWM_CH0H_EN_POS))
#define PWM_CR_PWM_CH1L_EN      PWM_CR_PWM_CH1L_EN
#define PWM_CR_PWM_CH1L_EN_POS  (2U)
#define PWM_CR_PWM_CH1L_EN_LEN  (1U)
#define PWM_CR_PWM_CH1L_EN_MSK  (((1U << PWM_CR_PWM_CH1L_EN_LEN) - 1) << PWM_CR_PWM_CH1L_EN_POS)
#define PWM_CR_PWM_CH1L_EN_UMSK (~(((1U << PWM_CR_PWM_CH1L_EN_LEN) - 1) << PWM_CR_PWM_CH1L_EN_POS))
#define PWM_CR_PWM_CH1H_EN      PWM_CR_PWM_CH1H_EN
#define PWM_CR_PWM_CH1H_EN_POS  (3U)
#define PWM_CR_PWM_CH1H_EN_LEN  (1U)
#define PWM_CR_PWM_CH1H_EN_MSK  (((1U << PWM_CR_PWM_CH1H_EN_LEN) - 1) << PWM_CR_PWM_CH1H_EN_POS)
#define PWM_CR_PWM_CH1H_EN_UMSK (~(((1U << PWM_CR_PWM_CH1H_EN_LEN) - 1) << PWM_CR_PWM_CH1H_EN_POS))
#define PWM_CR_PWM_CH2L_EN      PWM_CR_PWM_CH2L_EN
#define PWM_CR_PWM_CH2L_EN_POS  (4U)
#define PWM_CR_PWM_CH2L_EN_LEN  (1U)
#define PWM_CR_PWM_CH2L_EN_MSK  (((1U << PWM_CR_PWM_CH2L_EN_LEN) - 1) << PWM_CR_PWM_CH2L_EN_POS)
#define PWM_CR_PWM_CH2L_EN_UMSK (~(((1U << PWM_CR_PWM_CH2L_EN_LEN) - 1) << PWM_CR_PWM_CH2L_EN_POS))
#define PWM_CR_PWM_CH2H_EN      PWM_CR_PWM_CH2H_EN
#define PWM_CR_PWM_CH2H_EN_POS  (5U)
#define PWM_CR_PWM_CH2H_EN_LEN  (1U)
#define PWM_CR_PWM_CH2H_EN_MSK  (((1U << PWM_CR_PWM_CH2H_EN_LEN) - 1) << PWM_CR_PWM_CH2H_EN_POS)
#define PWM_CR_PWM_CH2H_EN_UMSK (~(((1U << PWM_CR_PWM_CH2H_EN_LEN) - 1) << PWM_CR_PWM_CH2H_EN_POS))
#define PWM_CR_PWM_CH3L_EN      PWM_CR_PWM_CH3L_EN
#define PWM_CR_PWM_CH3L_EN_POS  (6U)
#define PWM_CR_PWM_CH3L_EN_LEN  (1U)
#define PWM_CR_PWM_CH3L_EN_MSK  (((1U << PWM_CR_PWM_CH3L_EN_LEN) - 1) << PWM_CR_PWM_CH3L_EN_POS)
#define PWM_CR_PWM_CH3L_EN_UMSK (~(((1U << PWM_CR_PWM_CH3L_EN_LEN) - 1) << PWM_CR_PWM_CH3L_EN_POS))
#define PWM_CR_PWM_CH3H_EN      PWM_CR_PWM_CH3H_EN
#define PWM_CR_PWM_CH3H_EN_POS  (7U)
#define PWM_CR_PWM_CH3H_EN_LEN  (1U)
#define PWM_CR_PWM_CH3H_EN_MSK  (((1U << PWM_CR_PWM_CH3H_EN_LEN) - 1) << PWM_CR_PWM_CH3H_EN_POS)
#define PWM_CR_PWM_CH3H_EN_UMSK (~(((1U << PWM_CR_PWM_CH3H_EN_LEN) - 1) << PWM_CR_PWM_CH3H_EN_POS))
#define PWM_CR_PWM_PRDE_EN      PWM_CR_PWM_PRDE_EN
#define PWM_CR_PWM_PRDE_EN_POS  (8U)
#define PWM_CR_PWM_PRDE_EN_LEN  (1U)
#define PWM_CR_PWM_PRDE_EN_MSK  (((1U << PWM_CR_PWM_PRDE_EN_LEN) - 1) << PWM_CR_PWM_PRDE_EN_POS)
#define PWM_CR_PWM_PRDE_EN_UMSK (~(((1U << PWM_CR_PWM_PRDE_EN_LEN) - 1) << PWM_CR_PWM_PRDE_EN_POS))
#define PWM_CR_PWM_BRK_EN       PWM_CR_PWM_BRK_EN
#define PWM_CR_PWM_BRK_EN_POS   (9U)
#define PWM_CR_PWM_BRK_EN_LEN   (1U)
#define PWM_CR_PWM_BRK_EN_MSK   (((1U << PWM_CR_PWM_BRK_EN_LEN) - 1) << PWM_CR_PWM_BRK_EN_POS)
#define PWM_CR_PWM_BRK_EN_UMSK  (~(((1U << PWM_CR_PWM_BRK_EN_LEN) - 1) << PWM_CR_PWM_BRK_EN_POS))
#define PWM_CR_PWM_REPT_EN      PWM_CR_PWM_REPT_EN
#define PWM_CR_PWM_REPT_EN_POS  (10U)
#define PWM_CR_PWM_REPT_EN_LEN  (1U)
#define PWM_CR_PWM_REPT_EN_MSK  (((1U << PWM_CR_PWM_REPT_EN_LEN) - 1) << PWM_CR_PWM_REPT_EN_POS)
#define PWM_CR_PWM_REPT_EN_UMSK (~(((1U << PWM_CR_PWM_REPT_EN_LEN) - 1) << PWM_CR_PWM_REPT_EN_POS))

struct pwm_reg {
    /* 0x0 : pwm_int_config */
    union {
        struct {
            uint32_t pwm_sc0_int_sts : 1;  /* [    0],          r,        0x0 */
            uint32_t pwm_mc0_int_sts : 1;  /* [    1],          r,        0x0 */
            uint32_t reserved_2_7    : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t pwm_sc0_int_clr : 1;  /* [    8],        w1c,        0x0 */
            uint32_t pwm_mc0_int_clr : 1;  /* [    9],        w1c,        0x0 */
            uint32_t reserved_10_31  : 22; /* [31:10],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_int_config;

    /* 0x4  reserved */
    uint8_t RESERVED0x4[60];

    /* 0x40 : pwm0_clkdiv */
    union {
        struct {
            uint32_t pwm_clk_div    : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm0_clkdiv;

    /* 0x44 : pwm0_thre1 */
    union {
        struct {
            uint32_t pwm_thre1      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm0_thre1;

    /* 0x48 : pwm0_thre2 */
    union {
        struct {
            uint32_t pwm_thre2      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm0_thre2;

    /* 0x4C : pwm0_period */
    union {
        struct {
            uint32_t pwm_period     : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm0_period;

    /* 0x50 : pwm0_config */
    union {
        struct {
            uint32_t reg_clk_sel      : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t pwm_out_inv      : 1;  /* [    2],        r/w,        0x0 */
            uint32_t pwm_stop_mode    : 1;  /* [    3],        r/w,        0x1 */
            uint32_t pwm_sw_force_val : 1;  /* [    4],        r/w,        0x0 */
            uint32_t pwm_sw_mode      : 1;  /* [    5],        r/w,        0x0 */
            uint32_t pwm_stop_en      : 1;  /* [    6],        r/w,        0x0 */
            uint32_t pwm_sts_top      : 1;  /* [    7],          r,        0x0 */
            uint32_t pwm_stop_on_int  : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_31    : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm0_config;

