bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/pwm_reg.h
    /* 0x54 : pwm0_interrupt */
    union {
        struct {
            uint32_t pwm_int_period_cnt : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t pwm_int_enable     : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31     : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm0_interrupt;

    /* 0x58  reserved */
    uint8_t RESERVED0x58[40];

    /* 0x80 : pwm_mc0_config0 */
    union {
        struct {
            uint32_t pwm_clk_div      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_18   : 3;  /* [18:16],       rsvd,        0x0 */
            uint32_t pwm_stop_on_rept : 1;  /* [   19],        r/w,        0x0 */
            uint32_t pwm_adc_trg_src  : 4;  /* [23:20],        r/w,        0xf */
            uint32_t pwm_sw_break_en  : 1;  /* [   24],        r/w,        0x0 */
            uint32_t pwm_ext_break_en : 1;  /* [   25],        r/w,        0x0 */
            uint32_t pwm_ext_break_pl : 1;  /* [   26],        r/w,        0x0 */
            uint32_t pwm_stop_en      : 1;  /* [   27],        r/w,        0x0 */
            uint32_t pwm_stop_mode    : 1;  /* [   28],        r/w,        0x1 */
            uint32_t pwm_sts_stop     : 1;  /* [   29],          r,        0x0 */
            uint32_t reg_clk_sel      : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_mc0_config0;

    /* 0x84 : pwm_mc0_config1 */
    union {
        struct {
            uint32_t pwm_ch0_pen : 1; /* [    0],        r/w,        0x0 */
            uint32_t pwm_ch0_psi : 1; /* [    1],        r/w,        0x0 */
            uint32_t pwm_ch0_nen : 1; /* [    2],        r/w,        0x0 */
            uint32_t pwm_ch0_nsi : 1; /* [    3],        r/w,        0x1 */
            uint32_t pwm_ch1_pen : 1; /* [    4],        r/w,        0x0 */
            uint32_t pwm_ch1_psi : 1; /* [    5],        r/w,        0x0 */
            uint32_t pwm_ch1_nen : 1; /* [    6],        r/w,        0x0 */
            uint32_t pwm_ch1_nsi : 1; /* [    7],        r/w,        0x1 */
            uint32_t pwm_ch2_pen : 1; /* [    8],        r/w,        0x0 */
            uint32_t pwm_ch2_psi : 1; /* [    9],        r/w,        0x0 */
            uint32_t pwm_ch2_nen : 1; /* [   10],        r/w,        0x0 */
            uint32_t pwm_ch2_nsi : 1; /* [   11],        r/w,        0x1 */
            uint32_t pwm_ch3_pen : 1; /* [   12],        r/w,        0x0 */
            uint32_t pwm_ch3_psi : 1; /* [   13],        r/w,        0x0 */
            uint32_t pwm_ch3_nen : 1; /* [   14],        r/w,        0x0 */
            uint32_t pwm_ch3_nsi : 1; /* [   15],        r/w,        0x1 */
            uint32_t pwm_ch0_ppl : 1; /* [   16],        r/w,        0x1 */
            uint32_t pwm_ch0_npl : 1; /* [   17],        r/w,        0x1 */
            uint32_t pwm_ch1_ppl : 1; /* [   18],        r/w,        0x1 */
            uint32_t pwm_ch1_npl : 1; /* [   19],        r/w,        0x1 */
            uint32_t pwm_ch2_ppl : 1; /* [   20],        r/w,        0x1 */
            uint32_t pwm_ch2_npl : 1; /* [   21],        r/w,        0x1 */
            uint32_t pwm_ch3_ppl : 1; /* [   22],        r/w,        0x1 */
            uint32_t pwm_ch3_npl : 1; /* [   23],        r/w,        0x1 */
            uint32_t pwm_ch0_pbs : 1; /* [   24],        r/w,        0x0 */
            uint32_t pwm_ch0_nbs : 1; /* [   25],        r/w,        0x0 */
            uint32_t pwm_ch1_pbs : 1; /* [   26],        r/w,        0x0 */
            uint32_t pwm_ch1_nbs : 1; /* [   27],        r/w,        0x0 */
            uint32_t pwm_ch2_pbs : 1; /* [   28],        r/w,        0x0 */
            uint32_t pwm_ch2_nbs : 1; /* [   29],        r/w,        0x0 */
            uint32_t pwm_ch3_pbs : 1; /* [   30],        r/w,        0x0 */
            uint32_t pwm_ch3_nbs : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_mc0_config1;

    /* 0x88 : pwm_mc0_period */
    union {
        struct {
            uint32_t pwm_period         : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t pwm_int_period_cnt : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_mc0_period;

    /* 0x8C : pwm_mc0_dead_time */
    union {
        struct {
            uint32_t pwm_ch0_dtg : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t pwm_ch1_dtg : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t pwm_ch2_dtg : 8; /* [23:16],        r/w,        0x0 */
            uint32_t pwm_ch3_dtg : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_mc0_dead_time;

    /* 0x90 : pwm_mc0_ch0_thre */
    union {
        struct {
            uint32_t pwm_ch0_threL : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t pwm_ch0_threH : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_mc0_ch0_thre;

    /* 0x94 : pwm_mc0_ch1_thre */
    union {
        struct {
            uint32_t pwm_ch1_threL : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t pwm_ch1_threH : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_mc0_ch1_thre;

    /* 0x98 : pwm_mc0_ch2_thre */
    union {
        struct {
            uint32_t pwm_ch2_threL : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t pwm_ch2_threH : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_mc0_ch2_thre;

    /* 0x9C : pwm_mc0_ch3_thre */
    union {
        struct {
            uint32_t pwm_ch3_threL : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t pwm_ch3_threH : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_mc0_ch3_thre;

    /* 0xA0 : pwm_mc0_int_sts */
    union {
        struct {
            uint32_t pwm_ch0l_int   : 1;  /* [    0],          r,        0x0 */
            uint32_t pwm_ch0h_int   : 1;  /* [    1],          r,        0x0 */
            uint32_t pwm_ch1l_int   : 1;  /* [    2],          r,        0x0 */
            uint32_t pwm_ch1h_int   : 1;  /* [    3],          r,        0x0 */
            uint32_t pwm_ch2l_int   : 1;  /* [    4],          r,        0x0 */
            uint32_t pwm_ch2h_int   : 1;  /* [    5],          r,        0x0 */
            uint32_t pwm_ch3l_int   : 1;  /* [    6],          r,        0x0 */
            uint32_t pwm_ch3h_int   : 1;  /* [    7],          r,        0x0 */
            uint32_t pwm_prde_int   : 1;  /* [    8],          r,        0x0 */
            uint32_t pwm_brk_int    : 1;  /* [    9],          r,        0x0 */
            uint32_t pwm_rept_int   : 1;  /* [   10],          r,        0x0 */
            uint32_t reserved_11_31 : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_mc0_int_sts;

    /* 0xA4 : pwm_mc0_int_mask */
    union {
        struct {
            uint32_t cr_pwm_ch0l_mask : 1;  /* [    0],        r/w,        0x1 */
            uint32_t cr_pwm_ch0h_mask : 1;  /* [    1],        r/w,        0x1 */
            uint32_t cr_pwm_ch1l_mask : 1;  /* [    2],        r/w,        0x1 */
            uint32_t cr_pwm_ch1h_mask : 1;  /* [    3],        r/w,        0x1 */
            uint32_t cr_pwm_ch2l_mask : 1;  /* [    4],        r/w,        0x1 */
            uint32_t cr_pwm_ch2h_mask : 1;  /* [    5],        r/w,        0x1 */
            uint32_t cr_pwm_ch3l_mask : 1;  /* [    6],        r/w,        0x1 */
            uint32_t cr_pwm_ch3h_mask : 1;  /* [    7],        r/w,        0x1 */
            uint32_t cr_pwm_prde_mask : 1;  /* [    8],        r/w,        0x1 */
            uint32_t cr_pwm_brk_mask  : 1;  /* [    9],        r/w,        0x1 */
            uint32_t cr_pwm_rept_mask : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31   : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_mc0_int_mask;

    /* 0xA8 : pwm_mc0_int_clear */
    union {
        struct {
            uint32_t cr_pwm_ch0l_clr : 1;  /* [    0],        w1c,        0x0 */
            uint32_t cr_pwm_ch0h_clr : 1;  /* [    1],        w1c,        0x0 */
            uint32_t cr_pwm_ch1l_clr : 1;  /* [    2],        w1c,        0x0 */
            uint32_t cr_pwm_ch1h_clr : 1;  /* [    3],        w1c,        0x0 */
            uint32_t cr_pwm_ch2l_clr : 1;  /* [    4],        w1c,        0x0 */
            uint32_t cr_pwm_ch2h_clr : 1;  /* [    5],        w1c,        0x0 */
            uint32_t cr_pwm_ch3l_clr : 1;  /* [    6],        w1c,        0x0 */
            uint32_t cr_pwm_ch3h_clr : 1;  /* [    7],        w1c,        0x0 */
            uint32_t cr_pwm_prde_clr : 1;  /* [    8],        w1c,        0x0 */
            uint32_t cr_pwm_brk_clr  : 1;  /* [    9],        w1c,        0x0 */
            uint32_t cr_pwm_rept_clr : 1;  /* [   10],        w1c,        0x0 */
            uint32_t reserved_11_31  : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_mc0_int_clear;

    /* 0xAC : pwm_mc0_int_en */
    union {
        struct {
            uint32_t cr_pwm_ch0l_en : 1;  /* [    0],        r/w,        0x1 */
            uint32_t cr_pwm_ch0h_en : 1;  /* [    1],        r/w,        0x1 */
            uint32_t cr_pwm_ch1l_en : 1;  /* [    2],        r/w,        0x1 */
            uint32_t cr_pwm_ch1h_en : 1;  /* [    3],        r/w,        0x1 */
            uint32_t cr_pwm_ch2l_en : 1;  /* [    4],        r/w,        0x1 */
            uint32_t cr_pwm_ch2h_en : 1;  /* [    5],        r/w,        0x1 */
            uint32_t cr_pwm_ch3l_en : 1;  /* [    6],        r/w,        0x1 */
            uint32_t cr_pwm_ch3h_en : 1;  /* [    7],        r/w,        0x1 */
            uint32_t cr_pwm_prde_en : 1;  /* [    8],        r/w,        0x1 */
            uint32_t cr_pwm_brk_en  : 1;  /* [    9],        r/w,        0x1 */
            uint32_t cr_pwm_rept_en : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31 : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_mc0_int_en;
};

typedef volatile struct pwm_reg pwm_reg_t;

#endif /* __PWM_REG_H__ */
